```terraform
[command]/home/runner/work/_temp/33d6a994-5ec7-4a6d-92cc-a82261af740f/terraform-bin plan -out=environment.tfplan -no-color
module.vpc.data.aws_subnet.private_1[0]: Reading...
module.vpc.data.aws_subnet.public_2[0]: Reading...
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.vpc.data.aws_security_group.ec2_public[0]: Reading...
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.vpc.data.aws_subnet.private_2[0]: Reading...
module.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]
module.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.vpc.data.aws_vpc.default: Reading...
module.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]
module.vpc.data.aws_subnet.public_1[0]: Reading...
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/api_gateway/id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/id because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: e071501a-d2e0-475c-a7fe-99a25790e13f

  with module.apigateway.aws_ssm_parameter.api_gateway_id,
  on modules/apigateway/ssm.tf line 1, in resource "aws_ssm_parameter" "api_gateway_id":
   1: resource "aws_ssm_parameter" "api_gateway_id" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/api_gateway/root_resource_id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/root_resource_id because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: b56b6f6e-dc8f-4b03-87b3-30bf488c0e3b

  with module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id,
  on modules/apigateway/ssm.tf line 7, in resource "aws_ssm_parameter" "api_gateway_root_resource_id":
   7: resource "aws_ssm_parameter" "api_gateway_root_resource_id" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/endpoint): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/endpoint because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: d4080703-dfb8-4e5d-8f68-4ac0f3ee0e0e

  with module.rds.aws_ssm_parameter.db_instance_endpoint,
  on modules/rds/ssm.tf line 1, in resource "aws_ssm_parameter" "db_instance_endpoint":
   1: resource "aws_ssm_parameter" "db_instance_endpoint" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_name): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_name because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 500a93ce-84cf-4ec2-be49-8bb4ea7a81b2

  with module.rds.aws_ssm_parameter.db_instance_name,
  on modules/rds/ssm.tf line 7, in resource "aws_ssm_parameter" "db_instance_name":
   7: resource "aws_ssm_parameter" "db_instance_name" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/port): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/port because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: e9877ae0-3ae9-4698-99ef-ac9d027ecdd0

  with module.rds.aws_ssm_parameter.db_instance_port,
  on modules/rds/ssm.tf line 13, in resource "aws_ssm_parameter" "db_instance_port":
  13: resource "aws_ssm_parameter" "db_instance_port" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_password): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_password because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 4925d7bf-b821-408e-ad5b-8136fd271bdb

  with module.rds.aws_ssm_parameter.db_instance_password,
  on modules/rds/ssm.tf line 19, in resource "aws_ssm_parameter" "db_instance_password":
  19: resource "aws_ssm_parameter" "db_instance_password" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_username): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_username because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: b7b9d5fd-2f3d-4251-902f-6a6fb935ef42

  with module.rds.aws_ssm_parameter.db_instance_username,
  on modules/rds/ssm.tf line 25, in resource "aws_ssm_parameter" "db_instance_username":
  25: resource "aws_ssm_parameter" "db_instance_username" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 3e26531c-c35a-48da-8410-af910873ae58

  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn,
  on modules/sqs/ssm.tf line 1, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn":
   1: resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 92a0d3f1-3fa2-4c5c-8404-d35df8a05a1f

  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url,
  on modules/sqs/ssm.tf line 7, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_url":
   7: resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 5723f937-5597-4eb0-9c81-480dcdf9a5fa

  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn,
  on modules/sqs/ssm.tf line 13, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn":
  13: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 34ec6790-a617-43e9-af5f-264f46bafb7c

  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url,
  on modules/sqs/ssm.tf line 19, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url":
  19: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {

::debug::Terraform exited with code 1.
::debug::stdout: module.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...%0Amodule.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: %0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/api_gateway/id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/id because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: e071501a-d2e0-475c-a7fe-99a25790e13f%0A%0A  with module.apigateway.aws_ssm_parameter.api_gateway_id,%0A  on modules/apigateway/ssm.tf line 1, in resource "aws_ssm_parameter" "api_gateway_id":%0A   1: resource "aws_ssm_parameter" "api_gateway_id" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/api_gateway/root_resource_id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/root_resource_id because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: b56b6f6e-dc8f-4b03-87b3-30bf488c0e3b%0A%0A  with module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id,%0A  on modules/apigateway/ssm.tf line 7, in resource "aws_ssm_parameter" "api_gateway_root_resource_id":%0A   7: resource "aws_ssm_parameter" "api_gateway_root_resource_id" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/endpoint): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/endpoint because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: d4080703-dfb8-4e5d-8f68-4ac0f3ee0e0e%0A%0A  with module.rds.aws_ssm_parameter.db_instance_endpoint,%0A  on modules/rds/ssm.tf line 1, in resource "aws_ssm_parameter" "db_instance_endpoint":%0A   1: resource "aws_ssm_parameter" "db_instance_endpoint" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_name): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_name because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 500a93ce-84cf-4ec2-be49-8bb4ea7a81b2%0A%0A  with module.rds.aws_ssm_parameter.db_instance_name,%0A  on modules/rds/ssm.tf line 7, in resource "aws_ssm_parameter" "db_instance_name":%0A   7: resource "aws_ssm_parameter" "db_instance_name" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/port): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/port because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: e9877ae0-3ae9-4698-99ef-ac9d027ecdd0%0A%0A  with module.rds.aws_ssm_parameter.db_instance_port,%0A  on modules/rds/ssm.tf line 13, in resource "aws_ssm_parameter" "db_instance_port":%0A  13: resource "aws_ssm_parameter" "db_instance_port" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_password): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_password because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 4925d7bf-b821-408e-ad5b-8136fd271bdb%0A%0A  with module.rds.aws_ssm_parameter.db_instance_password,%0A  on modules/rds/ssm.tf line 19, in resource "aws_ssm_parameter" "db_instance_password":%0A  19: resource "aws_ssm_parameter" "db_instance_password" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_username): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_username because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: b7b9d5fd-2f3d-4251-902f-6a6fb935ef42%0A%0A  with module.rds.aws_ssm_parameter.db_instance_username,%0A  on modules/rds/ssm.tf line 25, in resource "aws_ssm_parameter" "db_instance_username":%0A  25: resource "aws_ssm_parameter" "db_instance_username" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 3e26531c-c35a-48da-8410-af910873ae58%0A%0A  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn,%0A  on modules/sqs/ssm.tf line 1, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn":%0A   1: resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 92a0d3f1-3fa2-4c5c-8404-d35df8a05a1f%0A%0A  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url,%0A  on modules/sqs/ssm.tf line 7, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_url":%0A   7: resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 5723f937-5597-4eb0-9c81-480dcdf9a5fa%0A%0A  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn,%0A  on modules/sqs/ssm.tf line 13, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn":%0A  13: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 34ec6790-a617-43e9-af5f-264f46bafb7c%0A%0A  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url,%0A  on modules/sqs/ssm.tf line 19, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url":%0A  19: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```